---
type: City
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# City

`Autodesk.Revit.DB.City` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Latitude | — | `public double Latitude { get ; }` |
| Property | Longitude | — | `public double Longitude { get ; }` |
| Property | Name | — | `public string Name { get ; }` |
| Property | TimeZone | — | `public double TimeZone { get ; }` |
| Property | WeatherStation | 2011 | `public string WeatherStation { get ; }` |